// Reports on "update antivirus signatures == Scid-2011"
// based on OS Plattform
// Author: @janvonkirchheim

DeviceTvmSecureConfigurationAssessment 
| where ConfigurationId == "scid-2011" // update antivirus signatures
| join kind=leftouter DeviceTvmSecureConfigurationAssessmentKB on ConfigurationId 
| mv-expand  e = parse_json(Context)
| project DeviceName, OSPlatform, SignatureVersion=e[0], EngineVersion=e[1]
