// Author: jan geisbauer 
// @janvonkirchheim
// ------------------------
//
// Under some circumstances it is only allowed that users
// from country X logon to devices from country X. 
// This query finds logon from users from other countries than X.
// The query requires a property to identify the users from
// country X. In this example a specific Email Address.

let special_computers=
DeviceInfo
| where MachineGroup == "Special Clients" 
| summarize make_set(DeviceName);
let special_users=
AccountInfo
| where Country == "Special" 
| summarize make_set(AccountName);
let special_users_upn=
AccountInfo
| where Country == "Special" 
| summarize make_set(AccountUpn);
DeviceLogonEvents
| where Timestamp > ago(1d)
| where DeviceName in~ (Special_computers)
| where AccountName !in~ (Special_users)
| where AccountName !in~ (Special_users_upn)
| where AccountName != "" 
| where AccountDomain =~ "specialExcludeDomain"
